[custom]
; =============== 基础设置 ===============
mixed-port=7890
allow-lan=true
bind-address=0.0.0.0
ipv6=true
unified-delay=true

; =============== DNS 配置 ===============
dns:
  enable: true
  ipv6: true
  listen: 0.0.0.0:53
  prefer-h3: false
  respect-rules: true
  enhanced-mode: fake-ip
  fake-ip-range: 198.18.0.1/16
  fake-ip-filter:
    - "+.lan"
    - "+.local"
    - "+.msftconnecttest.com"
    - "+.msftncsi.com"
    - "localhost.ptlogin2.qq.com"
    - "localhost.sec.qq.com"
    - "localhost.work.weixin.qq.com"
  use-hosts: false
  use-system-hosts: false
  nameserver:
    - https://1.1.1.1/dns-query
    - https://dns.google/dns-query
  default-nameserver:
    - tls://223.5.5.5
    - tls://119.29.29.29
  proxy-server-nameserver:
    - https://doh.pub/dns-query
  direct-nameserver:
    - https://doh.pub/dns-query
    - https://dns.alidns.com/dns-query


[custom_proxy_group]
; =============== 核心策略组 ===============
🌍 Proxy`select`[]🔄 AUTO`[]🎯 DIRECT`[]🚫 REJECT`[]🇭🇰 香港总汇`[]🇹🇼 台湾总汇`[]🇯🇵 日本总汇`[]🇰🇷 韩国总汇`[]🇺🇸 美国总汇`[]🇩🇪 德国总汇`[]🇸🇬 新加坡总汇`[]🇫🇷 法国总汇`[]🇬🇧 英国总汇`[]🌐 其他总汇
🔄 AUTO`url-test`.*`https://www.gstatic.com/generate_204`300,,50

; =============== 分流策略组 ===============
🍎 Apple`select`[]🎯 DIRECT`[]🌍 Proxy`[]🚫 REJECT`[]🇭🇰 香港总汇`[]🇹🇼 台湾总汇`[]🇯🇵 日本总汇`[]🇰🇷 韩国总汇`[]🇺🇸 美国总汇`[]🇩🇪 德国总汇`[]🇸🇬 新加坡总汇`[]🇫🇷 法国总汇`[]🇬🇧 英国总汇`[]🌐 其他总汇
💬 即时通讯`select`[]🌍 Proxy`[]🎯 DIRECT
▶️ YouTube`select`[]🌍 Proxy`[]🎯 DIRECT
📺 BiliBili`select`[]🎯 DIRECT`[]🌍 Proxy
🤖 OpenAI`select`[]🌍 Proxy`[]🎯 DIRECT
🎵 TikTok`select`[]🌍 Proxy`[]🎯 DIRECT
🎧 Spotify`select`[]🌍 Proxy`[]🎯 DIRECT
🎬 Netflix`select`[]🌍 Proxy`[]🎯 DIRECT
🏰 Disney`select`[]🌍 Proxy`[]🎯 DIRECT
🔍 Google`select`[]🌍 Proxy`[]🎯 DIRECT
☁️ OneDrive`select`[]🎯 DIRECT`[]🌍 Proxy
🪟 Microsoft`select`[]🎯 DIRECT`[]🌍 Proxy
🐦 Twitter`select`[]🌍 Proxy`[]🎯 DIRECT
🎞️ Emby`select`[]🌍 Proxy`[]🎯 DIRECT
🎮 Steam`select`[]🎯 DIRECT`[]🌍 Proxy
🐱 Github`select`[]🌍 Proxy`[]🎯 DIRECT
🌐 社交媒体`select`[]🌍 Proxy`[]🎯 DIRECT
📺 Bahamut`select`[]🌍 Proxy`[]🎯 DIRECT
🎮 游戏平台`select`[]🌍 Proxy`[]🎯 DIRECT
🌎 国外媒体`select`[]🌍 Proxy`[]🎯 DIRECT
🛒 国外电商`select`[]🌍 Proxy`[]🎯 DIRECT
🐟 漏网之鱼`select`[]🎯 DIRECT`[]🌍 Proxy

; =============== 地区测速组 ===============
🇭🇰 香港总汇`url-test`(🇭🇰|香港|港|HK|hongkong|hong kong)`https://www.gstatic.com/generate_204`300,,50
🇹🇼 台湾总汇`url-test`(🇹🇼|台湾|台|TW|taiwan|taipei)`https://www.gstatic.com/generate_204`300,,50
🇯🇵 日本总汇`url-test`(🇯🇵|日本|JP|japan|tokyo|osaka)`https://www.gstatic.com/generate_204`300,,50
🇰🇷 韩国总汇`url-test`(🇰🇷|韩国|韩|KR|korea|seoul)`https://www.gstatic.com/generate_204`300,,50
🇺🇸 美国总汇`url-test`(🇺🇸|美国|美|US|united states|america|los angeles|san jose|silicon valley)`https://www.gstatic.com/generate_204`300,,50
🇩🇪 德国总汇`url-test`(🇩🇪|德国|德|DE|germany|frankfurt)`https://www.gstatic.com/generate_204`300,,50
🇸🇬 新加坡总汇`url-test`(🇸🇬|新加坡|新|SG|singapore)`https://www.gstatic.com/generate_204`300,,50
🇫🇷 法国总汇`url-test`(🇫🇷|法国|法|FR|france|paris)`https://www.gstatic.com/generate_204`300,,50
🇬🇧 英国总汇`url-test`(🇬🇧|英国|英|UK|united kingdom|london)`https://www.gstatic.com/generate_204`300,,50
🌐 其他总汇`url-test`(?i)^(?!.*(🇭🇰|🇹🇼|🇯🇵|🇰🇷|🇸🇬|🇺🇸|🇬🇧|🇩🇪|🇫🇷|香港|台湾|日本|韩国|新加坡|美国|英国|德国|法国|港|台|日|韩|新|美|英|德|法|hk|tw|jp|kr|sg|us|uk|de|fr|hongkong|hong kong|taiwan|taipei|japan|tokyo|osaka|kyoto|korea|seoul|busan|singapore|united states|america|new york|los angeles|san jose|silicon valley|united kingdom|london|manchester|germany|frankfurt|berlin|france|paris)).*`https://www.gstatic.com/generate_204`300,,50

; =============== 基础策略组 ===============
🎯 DIRECT`select`[]DIRECT
🚫 REJECT`select`[]REJECT


[custom_rule_provider]
MyDirect,https://raw.githubusercontent.com/shineben/MyClash/refs/heads/main/MyDirect.yaml,classical
MyProxy,https://raw.githubusercontent.com/shineben/MyClash/refs/heads/main/MyProxy.yaml,classical
gfw-rule-set,https://fastly.jsdelivr.net/gh/Loyalsoldier/clash-rules@release/gfw.txt,domain
Emby,https://cdn.jsdelivr.net/gh/blackmatrix7/ios_rule_script@master/rule/Clash/Emby/Emby.yaml,classical


[custom_rules]
; --- 私有高优先级规则 ---
RULE-SET,MyDirect,🎯 DIRECT
RULE-SET,MyProxy,🌍 Proxy

; --- 本地/私有IP直连 ---
IP-CIDR,192.168.0.0/16,🎯 DIRECT,no-resolve
IP-CIDR,10.0.0.0/8,🎯 DIRECT,no-resolve
IP-CIDR,172.16.0.0/12,🎯 DIRECT,no-resolve
IP-CIDR,127.0.0.0/8,🎯 DIRECT,no-resolve
IP-CIDR,100.64.0.0/10,🎯 DIRECT,no-resolve
IP-CIDR,224.0.0.0/4,🎯 DIRECT,no-resolve
IP-CIDR,fe80::/10,🎯 DIRECT,no-resolve
IP-CIDR,::1/128,🎯 DIRECT,no-resolve
GEOSITE,private,🎯 DIRECT
GEOIP,private,🎯 DIRECT,no-resolve

; --- 中国常用服务直连 ---
GEOSITE,google-cn,🎯 DIRECT
GEOSITE,category-games@cn,🎯 DIRECT
GEOSITE,category-game-platforms-download,🎯 DIRECT
GEOSITE,category-public-tracker,🎯 DIRECT

; --- GEOSITE 分流 ---
GEOSITE,category-communication,💬 即时通讯
GEOSITE,category-social-media-!cn,🌐 社交媒体
GEOSITE,apple,🍎 Apple
GEOSITE,github,🐱 Github
GEOSITE,youtube,▶️ YouTube
GEOSITE,google,🔍 Google
GEOSITE,googlefcm,🔍 Google
GEOSITE,bilibili,📺 BiliBili
DOMAIN-KEYWORD,copilot,🤖 OpenAI
GEOSITE,openai,🤖 OpenAI
GEOSITE,tiktok,🎵 TikTok
GEOSITE,spotify,🎧 Spotify
GEOSITE,bahamut,📺 Bahamut
GEOSITE,netflix,🎬 Netflix
GEOSITE,disney,🏰 Disney
GEOSITE,onedrive,☁️ OneDrive
GEOSITE,microsoft,🪟 Microsoft
GEOSITE,twitter,🐦 Twitter
GEOSITE,steam,🎮 Steam
GEOSITE,category-games,🎮 游戏平台
GEOSITE,category-entertainment,🌎 国外媒体
GEOSITE,category-ecommerce,🛒 国外电商
RULE-SET,Emby,🎞️ Emby

; --- 境外流量补充 ---
GEOSITE,gfw,🌍 Proxy
RULE-SET,gfw-rule-set,🌍 Proxy

; --- GEOIP 补充分流 ---
GEOIP,telegram,💬 即时通讯,no-resolve
GEOIP,twitter,🌐 社交媒体,no-resolve
GEOIP,facebook,🌐 社交媒体,no-resolve
GEOIP,google,🔍 Google,no-resolve
GEOIP,netflix,🎬 Netflix,no-resolve

; --- 中国大陆直连 ---
GEOSITE,cn,🎯 DIRECT
GEOIP,CN,🎯 DIRECT,no-resolve

; --- 兜底 ---
MATCH,🐟 漏网之鱼

;下方参数请勿修改
enable_rule_generator=true
overwrite_original_rules=true